#### MEPConnectorInfo Members

---

|  |
| --- |
| MEPConnectorInfo Class   Methods   Properties   See Also |

The  MEPConnectorInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  MEPConnectorInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsPrimary | True if this is the primary connector. |
| Public property | IsSecondary | True if this is the secondary connector. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LinkedConnector | The linked connector or    a null reference (  Nothing  in Visual Basic)  if there is no linked connector |

# See Also

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace